precursor_kOmega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    freeSurface
    {
        type            patch;
        nFaces          90;
        startFace       5598;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          720;
        startFace       5688;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          720;
        startFace       6408;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sidewalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       7128;
    }
    noSlipWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       7272;
    }
)

// ************************************************************************* //
