precursor_kOmega/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2160
(
(0.0285172 -5.00181e-09 2.51576e-09)
(0.0255776 2.75813e-08 -2.07407e-09)
(0.0285184 -6.12233e-08 3.61943e-09)
(0.0715282 -1.7141e-08 1.46206e-08)
(0.0721402 4.88016e-08 -1.85776e-08)
(0.0715321 -6.8155e-08 1.91627e-08)
(0.0707293 -1.46213e-08 1.33116e-08)
(0.070938 3.97092e-08 -1.65211e-08)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
