precursor_kOmega/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            calculated;
        value           nonuniform List<vector> 
144
(
(-4.91586e-06 -9.79126e-09 3.03542e-11)
(-1.87661e-05 -6.4775e-08 4.73163e-11)
(-2.65806e-05 -6.52686e-08 1.87471e-11)
(-3.99348e-05 -7.79218e-08 -1.44684e-11)
(-5.05386e-05 -8.6397e-08 -4.87425e-11)
(-5.76945e-05 -7.66228e-08 -7.94215e-11)
(-7.06795e-05 -8.65153e-08 -9.03952e-11)
(-7.78038e-05 -7.92797e-08 -7.16694e-11)
...
)
;
    }
    noSlipWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
90
(
(-9.26215e-05 1.55456e-11 -9.81417e-09)
(-0.000232318 5.52346e-11 1.96342e-09)
(-0.000229723 4.72834e-11 6.25568e-10)
(-0.000356878 2.15467e-11 -1.29071e-09)
(-0.00033653 1.74366e-11 -2.80449e-09)
(-0.000358908 -2.24299e-11 -6.07899e-09)
(-0.000408838 -5.19388e-11 -9.3886e-11)
(-0.000362828 -1.99188e-11 -1.02651e-08)
...
)
;
    }
}


// ************************************************************************* //
