precursor_kOmega/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurface
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
16.4597
37.7949
44.1154
51.8748
56.4441
59.9305
65.5321
68.6036
...
)
;
    }
    noSlipWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
90
(
0.873591
1.99114
1.931
2.73094
2.59044
2.7149
3.04974
2.73592
...
)
;
    }
}


// ************************************************************************* //
